Autodesk.Revit.DB.ElementTransformUtils.CopyElements(Autodesk.Revit.DB.View,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.View,Autodesk.Revit.DB.Transform,Autodesk.Revit.DB.CopyPasteOptions)
Copies a set of elements from source view to destination view.
Remarks:
This method can be used for both view-specific and model elements.
Both source and destination views must be 2D graphics views capable of drawing details and view-specific elements (floor and ceiling plans, elevations, sections, drafting views.)
Drafting views cannot be used as a destination for model elements.
The pasted elements are repositioned to ensure proper placement in the destination view (e.g. elevation is changed when copying from a level to a different level.)
Additional transformation within the destination view can be performed by providing additionalTransform argument. This additional transformation must be within the plane of the destination view.
The destination view can be in the same document as the source view.
The destination view can be the same as the source view.
All view-specific elements in the set must be specific to the source view. Elements specific to views other than the source view or to multiple views cannot be copied.
sourceView:
The view in the source document that contains the elements to copy.
elementsToCopy:
The set of elements to copy.
destinationView:
The view in the destination document that the elements will be pasted into.
additionalTransform:
The transform for the new elements, in addition to the transformation between the source and destination views. Can be null if no transform is required. The transformation must be within the plane of the destination view.
options:
Optional settings. Can be null if default settings should be used.
Returns:
The ids of the newly created copied elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
The specified view cannot be used as a source or destination for copying elements between two views.
-or-
Some of the elements cannot be copied, because they belong to a different document.
-or-
Some of the elements cannot be copied, because they belong to a different view.
-or-
The elements cannot be copied into the destination view. Drafting views cannot contain model elements.
-or-
The transformation is not within the plane of the destination view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The elements cannot be copied.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
User cancelled the operation.
Since:
2014

Autodesk.Revit.DB.ElementTransformUtils.CopyElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Transform,Autodesk.Revit.DB.CopyPasteOptions)
Copies a set of elements from source document to destination document.
Remarks:
Copies are placed at their respective original locations or locations specified by the optional transformation.
This method can be used for copying non-view specific elements only. For copying view-specific elements, use the view-specific form of the CopyElements method.
The destination document can be the same as the source document.
sourceDocument:
The document that contains the elements to copy.
elementsToCopy:
The set of elements to copy.
destinationDocument:
The destination document to paste the elements into.
transform:
The transform for the new elements. Can be null if no transform is required.
options:
Optional settings. Can be null if default settings should be used.
Returns:
The ids of the newly created copied elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in elementsToCopy do not exist in the document.
-or-
Some of the elements cannot be copied, because they are view-specific.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The elements cannot be copied.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
User cancelled the operation.
Since:
2014

Autodesk.Revit.DB.ElementTransformUtils.RotateElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.Line,System.Double)
Rotates a set of elements about the given axis and angle.
document:
The document that owns the elements.
elementsToRotate:
The set of elements to rotate.
axis:
The axis of rotation.
angle:
The angle of rotation in radians.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in elementsToRotate do not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementTransformUtils.MirrorElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.Plane)
Creates a mirrored copy of a set of elements about a given plane.
document:
The document that owns the elements.
elementsToMirror:
The set of elements to mirror.
plane:
The mirror plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementsToMirror cannot be mirrored.
-or-
The given element id set is empty.
-or-
One or more elements in elementsToMirror do not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementTransformUtils.CopyElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.XYZ)
Copies a set of elements and places the copies at a location indicated by a given translation.
document:
The document that owns the elements.
elementsToCopy:
The set of elements to copy.
translation:
The translation vector for the new elements.
Returns:
The ids of the newly created copied elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in elementsToCopy do not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If we are not able to copy all the elements.
Since:
2012

Autodesk.Revit.DB.ElementTransformUtils.MoveElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.XYZ)
Moves a set of elements by a given transformation.
document:
The document that owns the elements.
elementsToMove:
The set of elements to move.
translation:
The translation vector for the elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in elementsToMove do not exist in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If we are not able to move all the elements (for example, if one or more elements is pinned).
-or-
Move operation failed.
Since:
2012

Autodesk.Revit.DB.ElementTransformUtils.CanMirrorElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Determines whether elements can be mirrored.
ADoc:
The document where the elements reside.
elemIds:
The elements identified by id.
Returns:
True if the elements can be mirrored.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012